BusinessProcesses/DMS_СогласованиеМакетовРекламнойКампании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<BusinessProcess>
		<Properties>
			<Name>DMS_СогласованиеМакетовРекламнойКампании</Name>
			<Task>Task.DMS_ЗадачаИсполнителя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_МакетыРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_РезультатыСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Comment>Важность задач точки действия Выполнить для исполнителя</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ВариантыВажностиЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИтерации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторитьСогласование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомитьИсполнителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РезультатыСогласования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатСогласования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.DMS_РезультатыСогласования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерИтерации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗадачаИсполнителя</Name>
							<Type>
								<v8:Type>cfg:TaskRef.DMS_ЗадачаИсполнителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСобытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаМаршрута</Name>
							<Type>
								<v8:Type>cfg:BusinessProcessRoutePointRef.DMS_СогласованиеМакетовРекламнойКампании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

InformationRegisters/DMS_СтатусыМакетовРекламныхКампаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_СтатусыМакетовРекламныхКампаний</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_СтатусыМакетовРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.DMS_МакетыРекламнойКампании</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РекламнаяКампания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_РекламнаяКампания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МакетРекламнойКампании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_МакетыРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/DMS_РезультатыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>DMS_РезультатыСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленКомментарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОзнакомленСКомменатрием</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/DMS_МакетыРекламнойКампании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_МакетыРекламнойКампании</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Представители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламнаяКампания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_РекламнаяКампания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_МакетыРекламнойКампанииПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедиаРесурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_МедиаРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АдресПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BusinessProcesses/DMS_СогласованиеМакетовРекламнойКампании/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////#Область ПрограммныйИнтерфейс

// Добавляет строку с результатом согласования рецензента в тч РезультатыСогласования
//
// Параметры:
//	ТочкаМаршрута         - ТочкаМаршрутаБизнесПроцессаСсылка.СогласованиеЦенНоменклатуры
//	Рецензент             - СправочникСсылка.Пользователи - исполнитель задачи по согласованию
//	РезультатСогласования - ПеречислениеСсылка.РезультатыСогласования
//	Комментарий           - Строка - комментарий рецензента
//	ДатаИсполнения        - Дата - дата выполнения задачи по согласованию рецензентом
//
Процедура ДобавитьРезультатСогласования(Знач ЗадачаИсполнителя,
	                                    Знач Исполнитель,
	                                    Знач РезультатСогласования,
	                                    Знач Комментарий,
	                                    Знач ДатаСобытия,
										Знач НомерИтерации,
										Знач ТочкаМаршрута) Экспорт
	
	НоваяСтрока                       = РезультатыСогласования.Добавить();
	НоваяСтрока.ЗадачаИсполнителя     = ЗадачаИсполнителя;
	НоваяСтрока.Исполнитель           = Исполнитель;
	НоваяСтрока.РезультатСогласования = РезультатСогласования;
	НоваяСтрока.Комментарий           = Комментарий;
	НоваяСтрока.ДатаСобытия           = ДатаСобытия;
	НоваяСтрока.НомерИтерации         = НомерИтерации;
	НоваяСтрока.ТочкаМаршрута         = ТочкаМаршрута;
		
КонецПроцедуры

////#КонецОбласти

////#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Дата согласования должна быть не меньше даты документа
	Если ЗначениеЗаполнено(ДатаСогласования) И ДатаСогласования < НачалоДня(Дата) Тогда
		
		ТекстОшибки = НСтр("ru='Дата согласования должна быть не меньше даты бизнес-процесса %Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата,"ДЛФ=DD"));
		
		Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"ДатаСогласования",
			,
			Отказ);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Предмет) Тогда
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	мМакет.Ссылка КАК Предмет,
		|	ВЫБОР
		|		КОГДА мМакет.ПометкаУдаления
		|				ИЛИ мМакет.Согласован
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьОшибкиСогласован,
		|	мМакет.ПометкаУдаления КАК ПометкаУдаления,
		|	ЕСТЬNULL(СтатусыМакетов.Статус, ЗНАЧЕНИЕ(Справочник.DMS_СтатусыМакетовРекламнойКампании.ПустаяСсылка)) КАК Статус
		|ИЗ
		|	Справочник.DMS_МакетыРекламнойКампании КАК мМакет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.DMS_СтатусыМакетовРекламныхКампаний.СрезПоследних КАК СтатусыМакетов
		|		ПО (СтатусыМакетов.РекламнаяКампания = мМакет.РекламнаяКампания)
		|			И мМакет.Ссылка = СтатусыМакетов.МакетРекламнойКампании
		|ГДЕ
		|	мМакет.Ссылка = &СправочникОснование");
		
	Запрос.УстановитьПараметр("СправочникОснование", Предмет);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
		// Документ уже согласован или помечен на удаление - нет смысла начинать согласование
		Если Выборка.ЕстьОшибкиСогласован Тогда
			
			ТекстОшибки = НСтр("ru='Макет %Предмет% не нуждается в согласовании макетов'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Предмет%", Выборка.Предмет);
			
			ВызватьИсключение ТекстОшибки;
			
		ИначеЕсли ЗначениеЗаполнено(Выборка.Статус) И Выборка.Статус <> Справочники.DMS_СтатусыМакетовРекламнойКампании.Заявлен 
			И Выборка.Статус <> Справочники.DMS_СтатусыМакетовРекламнойКампании.БезДействия Тогда 
			
			ТекстОшибки = НСтр("ru='По макету кампании %Предмет% уже запущен процесс согласования макетов'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Предмет%", Выборка.Предмет);
			
			ВызватьИсключение ТекстОшибки;
			
		ИначеЕсли Выборка.ПометкаУдаления Тогда
			
			ТекстОшибки = НСтр("ru='Макет %Предмет% не может быть согласован, т.к. помечен на удаление'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Предмет%", Выборка.Предмет);
			
			ВызватьИсключение ТекстОшибки;
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.DMS_МакетыРекламнойКампании") Тогда
		ЗаполнитьБизнесПроцессНаОснованииМакетаРекламнойКампании(ДанныеЗаполнения);
	КонецЕсли;
	
	ИнициализироватьБизнесПроцесс();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаНачала            = Дата(1,1,1);
	ДатаОкончания         = Дата(1,1,1);
	РезультатСогласования = Перечисления.DMS_РезультатыСогласования.ПустаяСсылка();
	
	РезультатыСогласования.Очистить();
	
	ИнициализироватьБизнесПроцесс();
	
КонецПроцедуры

////#КонецОбласти

////#Область ИнициализацияБизнесПроцесса

Процедура ЗаполнитьБизнесПроцессНаОснованииМакетаРекламнойКампании(Предмет)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	мМакет.Ссылка КАК Предмет,
		|	ВЫБОР
		|		КОГДА мМакет.ПометкаУдаления
		|				ИЛИ мМакет.Согласован
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьОшибкиСогласован,
		|	мМакет.ПометкаУдаления КАК ПометкаУдаления,
		|	ЕСТЬNULL(СтатусыМакетов.Статус, ЗНАЧЕНИЕ(Справочник.DMS_СтатусыМакетовРекламнойКампании.ПустаяСсылка)) КАК Статус,
		|	Неопределено КАК Исполнитель
		|ИЗ
		|	Справочник.DMS_МакетыРекламнойКампании КАК мМакет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.DMS_СтатусыМакетовРекламныхКампаний.СрезПоследних КАК СтатусыМакетов
		|		ПО (СтатусыМакетов.РекламнаяКампания = мМакет.РекламнаяКампания)
		|			И мМакет.Ссылка = СтатусыМакетов.МакетРекламнойКампании
		|ГДЕ
		|	мМакет.Ссылка = &СправочникОснование");
		
	Запрос.УстановитьПараметр("СправочникОснование", Предмет);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	// Документ уже согласован или помечен на удаление - нет смысла начинать согласование
	Если Выборка.ЕстьОшибкиСогласован Тогда
		
		ТекстОшибки = НСтр("ru='Макет %Предмет% не нуждается в согласовании макетов'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Предмет%", Выборка.Предмет);
		
		ВызватьИсключение ТекстОшибки;
				
	ИначеЕсли ЗначениеЗаполнено(Выборка.Статус) И Выборка.Статус <> Справочники.DMS_СтатусыМакетовРекламнойКампании.Заявлен 
		И Выборка.Статус <> Справочники.DMS_СтатусыМакетовРекламнойКампании.БезДействия Тогда 
		
		ТекстОшибки = НСтр("ru='По макету %Предмет% уже запущен процесс согласования макетов'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Предмет%", Выборка.Предмет);
		
		ВызватьИсключение ТекстОшибки;
		
	ИначеЕсли Выборка.ПометкаУдаления Тогда
		
		ТекстОшибки = НСтр("ru='Макет %Предмет% не может быть согласован, т.к. помечен на удаление'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Предмет%", Выборка.Предмет);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
КонецПроцедуры

Процедура ЗаполнитьДокументПоОтбору(Знач ДанныеЗаполнения)
	
	Если ДанныеЗаполнения.Свойство("Предмет") Тогда
		
		ТипПредмета = ТипЗнч(ДанныеЗаполнения.Предмет);
		
		Если ТипПредмета = Тип("СправочникСсылка.DMS_МакетыРекламнойКампании") Тогда
			ЗаполнитьБизнесПроцессНаОснованииМакетаРекламнойКампании(ДанныеЗаполнения.Предмет);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьБизнесПроцесс()
	
	Дата		  = ТекущаяДатаСеанса();
	Автор 		  = DMS_РекламныеКампанииСервер.ТекущийПользователь();
	НомерИтерации = 0;
	
	УведомитьИсполнителя = Истина;
	
КонецПроцедуры

////#КонецОбласти

////#Область Прочее

Процедура ЗаполнитьЗадачу(Задача,ТочкаМаршрута,мАвтор,мИсполнитель,мНаименование = "")
	
	Если Наименование = "" И мНаименование = "" Тогда
		мНаименование = СокрЛП(Предмет);
	КонецЕсли; 
	
	Задача.Дата 	= ТекущаяДатаСеанса();
	Задача.Автор 	= мАвтор;
	Задача.Описание = ?(мНаименование = "",Наименование,мНаименование);
	Задача.Важность = Важность;
	Задача.Предмет  = Предмет;
	
	Задача.Наименование   = ?(мНаименование = "",Наименование,мНаименование);
	Задача.БизнесПроцесс  = ЭтотОбъект.Ссылка;
	Задача.ТочкаМаршрута  = ТочкаМаршрута;
	Задача.Исполнитель    = мИсполнитель;	
		
КонецПроцедуры

////#КонецОбласти

#КонецЕсли

Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ДатаНачала = ТекущаяДатаСеанса();
	
КонецПроцедуры

Процедура ПодготовкаИтерацииСогласованияОбработка(ТочкаМаршрутаБизнесПроцесса)
		
	УстановитьПривилегированныйРежим(Истина);
	
	Отказ = Ложь;
	
	DMS_РекламныеКампанииСервер.ОтразитьСтатусМакетаРекламнойКампании(Ссылка,Предмет,ТекущаяДатаСеанса(),Справочники.DMS_СтатусыМакетовРекламнойКампании.НаСогласовании,Отказ);
	
	Если Отказ Тогда
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецЕсли; 
	
	НомерИтерации = НомерИтерации + 1;
	
	ПовторитьСогласование = Ложь;
	
	Записать();
	
КонецПроцедуры

Процедура СогласоватьПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	Задача = Задачи.DMS_ЗадачаИсполнителя.СоздатьЗадачу();
	
	Если Наименование = "" И ЗначениеЗаполнено(Предмет) Тогда
		мНаименование = СокрЛП(Предмет);
	Иначе 
		мНаименование = "";
	КонецЕсли; 
	
	ЗаполнитьЗадачу(Задача,БизнесПроцессы.DMS_СогласованиеМакетовРекламнойКампании.ТочкиМаршрута.Согласовать,Автор,Исполнитель,мНаименование);
	
	ЗадачаСсылка = Задачи.DMS_ЗадачаИсполнителя.ПолучитьСсылку();
	Задача.УстановитьСсылкуНового(ЗадачаСсылка);
	
	ФормируемыеЗадачи.Добавить(Задача);
	
	Если УведомитьИсполнителя И НомерИтерации = 1 Тогда
		DMS_РекламныеКампанииСервер.СформироватьУведомлениеИсполнителяОНовойЗадаче(Задача,ЗадачаСсылка);
	КонецЕсли; 
	
	НоваяСтрока = РезультатыСогласования.Добавить();
	НоваяСтрока.НомерИтерации         = НомерИтерации;
	НоваяСтрока.ЗадачаИсполнителя     = ЗадачаСсылка;
	НоваяСтрока.Исполнитель           = Задача.Исполнитель;
	НоваяСтрока.Комментарий		      = Наименование;
	НоваяСтрока.ДатаСобытия		      = ТекущаяДатаСеанса();
	НоваяСтрока.РезультатСогласования = Перечисления.DMS_РезультатыСогласования.НеСогласовано;
	
КонецПроцедуры

Процедура СогласоватьОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	Результат = Истина;
КонецПроцедуры

Процедура ОтправленКомментарийПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = (РезультатСогласования = Перечисления.DMS_РезультатыСогласования.ОтправленКомментарий);	
КонецПроцедуры

Процедура УсловиеСогласованПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = (РезультатСогласования = Перечисления.DMS_РезультатыСогласования.Согласовано);	
КонецПроцедуры

Процедура ПодготовкаИтерацииОзнакомленияСОтказомОбработка(ТочкаМаршрутаБизнесПроцесса)
		
	УстановитьПривилегированныйРежим(Истина);
	
	Отказ = Ложь;
	
	DMS_РекламныеКампанииСервер.ОтразитьСтатусМакетаРекламнойКампании(Ссылка,Предмет,ТекущаяДатаСеанса(),Справочники.DMS_СтатусыМакетовРекламнойКампании.НеСогласован,Отказ);
	
	Если Отказ Тогда
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецЕсли; 
		
КонецПроцедуры

Процедура ОзнакомитьсяСОтказомПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	Задача = Задачи.DMS_ЗадачаИсполнителя.СоздатьЗадачу();
	ЗаполнитьЗадачу(Задача,БизнесПроцессы.DMS_СогласованиеМакетовРекламнойКампании.ТочкиМаршрута.ОзнакомитьсяСОтказом,Исполнитель,Автор);
	
	ЗадачаСсылка = Задачи.DMS_ЗадачаИсполнителя.ПолучитьСсылку();
	Задача.УстановитьСсылкуНового(ЗадачаСсылка);
	
	ФормируемыеЗадачи.Добавить(Задача);
		
	НоваяСтрока = РезультатыСогласования.Добавить();
	НоваяСтрока.НомерИтерации         = НомерИтерации;
	НоваяСтрока.ЗадачаИсполнителя     = ЗадачаСсылка;
	НоваяСтрока.Исполнитель           = Задача.Исполнитель;
	НоваяСтрока.Комментарий		      = Наименование;
	НоваяСтрока.ДатаСобытия		      = ТекущаяДатаСеанса();
	НоваяСтрока.РезультатСогласования = Перечисления.DMS_РезультатыСогласования.НеСогласовано;

КонецПроцедуры

Процедура ОзнакомитьсяСОтказомПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Результат = Истина;
КонецПроцедуры

Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаЗавершения = ТекущаяДатаСеанса();
	
	СправочникОбъект = Предмет.ПолучитьОбъект();
	СправочникОбъект.ОбменДанными.Загрузка = Истина;
	СправочникОбъект.Согласован = Истина;
	СправочникОбъект.Записать();
	
КонецПроцедуры

Процедура ПодготовкаИтерацииОзнакомленияОбработка(ТочкаМаршрутаБизнесПроцесса)
		
	УстановитьПривилегированныйРежим(Истина);
	
	Отказ = Ложь;
	
	DMS_РекламныеКампанииСервер.ОтразитьСтатусМакетаРекламнойКампании(Ссылка,Предмет,ТекущаяДатаСеанса(),Справочники.DMS_СтатусыМакетовРекламнойКампании.Согласован,Отказ);
	
	Если Отказ Тогда
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОзнакомитьсяСРезультатомСогласованияПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	Задача = Задачи.DMS_ЗадачаИсполнителя.СоздатьЗадачу();
	ЗаполнитьЗадачу(Задача,БизнесПроцессы.DMS_СогласованиеМакетовРекламнойКампании.ТочкиМаршрута.ОзнакомитьсяСРезультатомСогласования,Исполнитель,Автор);
	
	ЗадачаСсылка = Задачи.DMS_ЗадачаИсполнителя.ПолучитьСсылку();
	Задача.УстановитьСсылкуНового(ЗадачаСсылка);
	
	ФормируемыеЗадачи.Добавить(Задача);
		
	НоваяСтрока = РезультатыСогласования.Добавить();
	НоваяСтрока.НомерИтерации         = НомерИтерации;
	НоваяСтрока.ЗадачаИсполнителя     = ЗадачаСсылка;
	НоваяСтрока.Исполнитель           = Задача.Исполнитель;
	НоваяСтрока.Комментарий		      = Наименование;
	НоваяСтрока.ДатаСобытия		      = ТекущаяДатаСеанса();
	НоваяСтрока.РезультатСогласования = Перечисления.DMS_РезультатыСогласования.Согласовано;

КонецПроцедуры

Процедура ОзнакомитьсяСРезультатомСогласованияОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	Результат = Истина;
КонецПроцедуры

Процедура ПодготовкаИтерацииКомментарийОбработка(ТочкаМаршрутаБизнесПроцесса)
		
	УстановитьПривилегированныйРежим(Истина);
	
	Отказ = Ложь;
	
	DMS_РекламныеКампанииСервер.ОтразитьСтатусМакетаРекламнойКампании(Ссылка,Предмет,ТекущаяДатаСеанса(),Справочники.DMS_СтатусыМакетовРекламнойКампании.КомментарииОтMMR,Отказ);
	
	Если Отказ Тогда
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецЕсли; 
		
	ПовторитьСогласование = Ложь;
	
	Записать();
	
КонецПроцедуры

Процедура ОзнакомитьсяСКомментариемПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	Задача = Задачи.DMS_ЗадачаИсполнителя.СоздатьЗадачу();
	ЗаполнитьЗадачу(Задача,БизнесПроцессы.DMS_СогласованиеМакетовРекламнойКампании.ТочкиМаршрута.ОзнакомитьсяСКомментарием,Исполнитель,Автор);
	
	ЗадачаСсылка = Задачи.DMS_ЗадачаИсполнителя.ПолучитьСсылку();
	Задача.УстановитьСсылкуНового(ЗадачаСсылка);
	
	ФормируемыеЗадачи.Добавить(Задача);
		
	НоваяСтрока = РезультатыСогласования.Добавить();
	НоваяСтрока.НомерИтерации         = НомерИтерации;
	НоваяСтрока.ЗадачаИсполнителя     = ЗадачаСсылка;
	НоваяСтрока.Исполнитель           = Задача.Исполнитель;
	НоваяСтрока.Комментарий		      = Наименование;
	НоваяСтрока.ДатаСобытия		      = ТекущаяДатаСеанса();
	НоваяСтрока.РезультатСогласования = Перечисления.DMS_РезультатыСогласования.ОзнакомленСКомменатрием;

КонецПроцедуры

Процедура ОзнакомитьсяСКомментариемОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	Результат = Истина;
КонецПроцедуры

Процедура ПодготовкаИтерацииОзнакомлениеСКомментариемОбработка(ТочкаМаршрутаБизнесПроцесса)
		
	УстановитьПривилегированныйРежим(Истина);
	
	Отказ = Ложь;
	
	DMS_РекламныеКампанииСервер.ОтразитьСтатусМакетаРекламнойКампании(Ссылка,Предмет,ТекущаяДатаСеанса(),Справочники.DMS_СтатусыМакетовРекламнойКампании.НаСогласовании,Отказ);
	
	Если Отказ Тогда
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецЕсли; 
	
	НомерИтерации = НомерИтерации + 1;
	
	//ПовторитьСогласование = Ложь;
	
	Записать();
	
КонецПроцедуры

Процедура ОтправитьЗановоПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПовторитьСогласование;
КонецПроцедуры

Процедура ПодготовкаИтерацииЗавершенияСогласованияОбработка(ТочкаМаршрутаБизнесПроцесса)
		
	УстановитьПривилегированныйРежим(Истина);
	
	Отказ = Ложь;
	
	DMS_РекламныеКампанииСервер.ОтразитьСтатусМакетаРекламнойКампании(Ссылка,Предмет,ТекущаяДатаСеанса(),Справочники.DMS_СтатусыМакетовРекламнойКампании.НеСогласован,Отказ);
	
	Если Отказ Тогда
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецЕсли; 
		
КонецПроцедуры

Процедура ЗавершениеНеСогласованПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	ДатаЗавершения = ТекущаяДатаСеанса();
КонецПроцедуры
